; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v8 ?v2)
             (pred_11 ?v4 ?v7)
             (pred_9 ?v8 ?v7)
             (pred_6 ?v11 ?v8 )
	     (pred_8 ?v8)
             (pred_7 ?v6)
             (pred_12 ?v4)
             (pred_4 ?v7)
             (pred_1 ?v8)
             (pred_5 ?v4)
             (pred_2 ?v8)
             (pred_3 ))



(:action op_3
:parameters (?v10 ?v5 ?v13 ?v3)
:precondition (and (pred_7 ?v10) (pred_7 ?v5) (pred_12 ?v13) (pred_4 ?v3)
          (pred_10 ?v10 ?v5) (pred_11 ?v13 ?v3)
                   (pred_9 ?v5 ?v3) (pred_8 ?v10) 
                   (pred_1 ?v5) (pred_5 ?v13))
:effect (and  (pred_2 ?v5) (not (pred_1 ?v5))))


(:action op_1
:parameters (?v10 ?v1)
:precondition (and (pred_7 ?v10) (pred_7 ?v1)
               (pred_8 ?v10) (pred_10 ?v10 ?v1) (pred_2 ?v1))
:effect (and (pred_8 ?v1) (not (pred_8 ?v10))))

(:action op_4
:parameters (?v10 ?v13)
:precondition (and (pred_7 ?v10) (pred_12 ?v13) 
                  (pred_8 ?v10) (pred_6 ?v13 ?v10) (pred_3 ))
:effect (and (pred_5 ?v13)
   (not (pred_6 ?v13 ?v10)) (not (pred_3 ))))


(:action op_2
:parameters (?v10 ?v9 ?v12)
:precondition (and (pred_7 ?v10) (pred_12 ?v9) (pred_12 ?v12)
                  (pred_8 ?v10) (pred_5 ?v12) (pred_6 ?v9 ?v10))
:effect (and (pred_5 ?v9) (pred_6 ?v12 ?v10)
        (not (pred_5 ?v12)) (not (pred_6 ?v9 ?v10))))

(:action op_5
:parameters (?v10 ?v13)
:precondition (and (pred_7 ?v10) (pred_12 ?v13) 
                  (pred_8 ?v10) (pred_5 ?v13))
:effect (and (pred_3 ) (pred_6 ?v13 ?v10) (not (pred_5 ?v13)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_02 obj_03 obj_01 obj_06 obj_11 obj_04 obj_13 obj_12 obj_05
    obj_10 obj_08
    obj_07 obj_09
    )

    (:init
       (pred_3)

       (pred_7 obj_02)
       (pred_7 obj_03)
       (pred_7 obj_01)
       (pred_7 obj_06)
       (pred_7 obj_11)
       (pred_7 obj_04)
       (pred_7 obj_13)
       (pred_7 obj_12)
       (pred_7 obj_05)
       (pred_4 obj_10)
       (pred_4 obj_08)
       (pred_12 obj_07)
       (pred_12 obj_09)

       (pred_10 obj_02 obj_06)
       (pred_10 obj_02 obj_03)
       (pred_10 obj_03 obj_11)
       (pred_10 obj_03 obj_01)
       (pred_10 obj_03 obj_02)
       (pred_10 obj_01 obj_04)
       (pred_10 obj_01 obj_03)
       (pred_10 obj_06 obj_13)
       (pred_10 obj_06 obj_11)
       (pred_10 obj_06 obj_02)
       (pred_10 obj_11 obj_12)
       (pred_10 obj_11 obj_04)
       (pred_10 obj_11 obj_03)
       (pred_10 obj_11 obj_06)
       (pred_10 obj_04 obj_05)
       (pred_10 obj_04 obj_01)
       (pred_10 obj_04 obj_11)
       (pred_10 obj_13 obj_12)
       (pred_10 obj_13 obj_06)
       (pred_10 obj_12 obj_05)
       (pred_10 obj_12 obj_11)
       (pred_10 obj_12 obj_13)
       (pred_10 obj_05 obj_04)
       (pred_10 obj_05 obj_12)
       (pred_1 obj_03)
       (pred_1 obj_05)
       (pred_9  obj_03 obj_10)
       (pred_9  obj_05 obj_08)
       (pred_2 obj_02)
       (pred_2 obj_01)
       (pred_2 obj_06)
       (pred_2 obj_11)
       (pred_2 obj_04)
       (pred_2 obj_13)
       (pred_2 obj_12)

       (pred_11  obj_07 obj_10)
       (pred_11  obj_09 obj_08)
       (pred_6 obj_07 obj_13)
       (pred_6 obj_09 obj_12)
       (pred_8 obj_01)
    )

    (:goal (and
       (pred_6 obj_07 obj_03)
    ))
(:constraints
  (always (not (pred_8 obj_06)))
)
)

; plan
1. (op_1 obj_01 obj_04)
   deleted: (pred_8 obj_01)
   added: (pred_8 obj_04)
   goals met: 0 of 1
2. (op_1 obj_04 obj_11)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_11)
   goals met: 0 of 1
3. (op_1 obj_11 obj_12)
   deleted: (pred_8 obj_11)
   added: (pred_8 obj_12)
   goals met: 0 of 1
4. (op_1 obj_12 obj_13)
   deleted: (pred_8 obj_12)
   added: (pred_8 obj_13)
   goals met: 0 of 1
5. (op_4 obj_13 obj_07)
   deleted: (pred_6 obj_07 obj_13) (pred_3)
   added: (pred_5 obj_07)
   goals met: 0 of 1
6. (op_1 obj_13 obj_12)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_12)
   goals met: 0 of 1
7. (op_1 obj_12 obj_11)
   deleted: (pred_8 obj_12)
   added: (pred_8 obj_11)
   goals met: 0 of 1
8. (op_3 obj_11 obj_03 obj_07 obj_10)
   deleted: (pred_1 obj_03)
   added: (pred_2 obj_03)
   goals met: 0 of 1
9. (op_1 obj_11 obj_03)
   deleted: (pred_8 obj_11)
   added: (pred_8 obj_03)
   goals met: 0 of 1
10. (op_5 obj_03 obj_07)
   deleted: (pred_5 obj_07)
   added: (pred_3) (pred_6 obj_07 obj_03)
   goals met: 1 of 1
